lib/xml/createDisposition.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:createDisposition>
            <!--Optional:-->
            <disposition>
                <!--Optional:-->
                <agentMustCompleteWorksheet>?</agentMustCompleteWorksheet>
                <!--Optional:-->
                <agentMustConfirm>?</agentMustConfirm>
                <!--Optional:-->
                <description>?</description>
                <!--Optional:-->
                <name>?</name>
                <!--Optional:-->
                <resetAttemptsCounter>?</resetAttemptsCounter>
                <!--Optional:-->
                <sendEmailNotification>?</sendEmailNotification>
                <!--Optional:-->
                <sendIMNotification>?</sendIMNotification>
                <!--Optional:-->
                <trackAsFirstCallResolution>?</trackAsFirstCallResolution>
                <!--Optional:-->
                <type>?</type>
                <!--Optional:-->
                <typeParameters>
                    <!--Optional:-->
                    <allowChangeTimer>?</allowChangeTimer>
                    <!--Optional:-->
                    <attempts>?</attempts>
                    <!--Optional:-->
                    <timer>
                        <days>?</days>
                        <hours>?</hours>
                        <minutes>?</minutes>
                        <seconds>?</seconds>
                    </timer>
                    <!--Optional:-->
                    <useTimer>?</useTimer>
                </typeParameters>
            </disposition>
        </ser:createDisposition>
    </soapenv:Body>
</soapenv:Envelope>